app/controllers/api/follows_controller.rb

INSERT INTO "follows" ("product_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 163], ["user_id", 96], ["created_at", "2020-03-27 22:44:56.643027"], ["updated_at", "2020-03-27 22:44:56.643027"]]
---
  def create
    @follow = Follow.new(follow_params)
    if @follow.save

SELECT  "follows".* FROM "follows" WHERE "follows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 1]]
---
  def destroy
    @item = Follow.find(params[:id])
    @item.destroy