app/controllers/api/follows_controller.rb

  def destroy
    @item = PortfolioItem.find(params[:id])
---
SELECT  "portfolio_items".* FROM "portfolio_items" WHERE "portfolio_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]