app/controllers/api/orders_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 157], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."product_id" = $1 AND (active = 'true')  [["product_id", 154]]
---
  def product_index
    @orders = Product.find(params[:product_id]).orders

INSERT INTO "orders" ("product_id", "asker_id", "price", "order_type", "active", "sold", "shipped", "created_at", "updated_at", "sex", "size") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    if @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "orders" SET "active" = $1, "sold" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["active", "false"], ["sold", "true"], ["updated_at", "2020-06-03 23:29:26.445843"], ["id", 71]]
---
  def update
    @order = Order.find(params[:id])
    if @order.update(order_params)