app/controllers/api/portfolio_items_controller.rb

SELECT "portfolio_items".* FROM "portfolio_items" WHERE "portfolio_items"."user_id" = $1  [["user_id", 21]]
---
  def index
    @items = PortfolioItem.where(user_id: current_user.id)

INSERT INTO "portfolio_items" ("user_id", "product_id", "size", "created_at", "updated_at", "purchase_price") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 23], ["product_id", 27], ["size", "F 0.5"], ["created_at", "2020-01-14 17:36:17.467618"], ["updated_at", "2020-01-14 17:36:17.467618"], ["purchase_price", 312]]
---
  def create
    @item = PortfolioItem.new(item_params)

    if @item.save

SELECT  "portfolio_items".* FROM "portfolio_items" WHERE "portfolio_items"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "portfolio_items" WHERE "portfolio_items"."id" = $1  [["id", 41]]
---
  def destroy
    @item = PortfolioItem.find(params[:id])
    @item.destroy