app/controllers/api/sales_controller.rb

  def product_index
    @sales = Product.find(params[:product_id]).sales
---
SELECT  "sales".* FROM "sales" WHERE "sales"."product_id" = $1 ORDER BY date desc LIMIT $2  [["product_id", 157], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 157], ["LIMIT", 1]]

  def product_last_sale
    @sale = Product.find(params[:product_id]).sales.last#order('date desc').limit(1)[0]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 157], ["LIMIT", 1]]
SELECT  "sales".* FROM "sales" WHERE "sales"."product_id" = $1 ORDER BY date desc LIMIT $2  [["product_id", 157], ["LIMIT", 1]]

  def product_size_index
    @sales = Product.find(params[:product_id]).sales.where("sales.size = #{params[:size]}")
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 170], ["LIMIT", 1]]

  def create
    @sale = Sale.new(sale_params)
    if @sale.save
---
INSERT INTO "sales" ("order_id", "product_id", "date", "active", "created_at", "updated_at", "price", "sex", "size") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"